{
  "Register": "Register",
  "Refund": "Refund",
  "Language": "Language",
  "eventTitle": "Ethereum All-Star Tech Talk",
  "eventDescription": "Taipei Ethereum Meetup has invited various developers and researchers in the Ethereum blockchain ecosystem to talk about the scalable solution of Sharding Client and the latest development and research progress.",
  "eventPayment": "This is a paid event. Participants will be required to pay Ether through our Ethereum smart contract in order to complete the registration.",
  "Agenda": "Agenda",
  "eventDate": "This event will be held on 21 March 2018 with the following agenda.",
  "Time": "Time",
  "Topic": "Topic",
  "Guests": "Guests",
  "Host": "Host",
  "registerDescription": "Our registration payment system is built on Ethereum Smart Contract. We will charge {fee} ETH as the registration fee. Make sure you have installed browsers or extensions which support web3. If you are using desktop browser, you can install MetaMask extension on Chrome / Firefox. If you are using your mobile phone, you can install Cipher or True.",
  "Name / Nickname": "Name / Nickname",
  "Email": "Email",
  "Wallet Address": "Wallet Address",
  "refundDescription": "You can refund your deposit with the verification code provided after the event has finished.",
  "Transaction": "Transaction",
  "Register With MetaMask" : "Register With MetaMask",
  "Event Status": "Event Status",
  "Attended": "Attended",
  "Not Yet Attended": "Not Yet Attended",
  "Register Status": "Register Status",
  "Registered": "Registered",
  "Not Yet Registered": "Not Yet Registered",
  "Alert No Wallet": "You have no wallet available in Metamask. Please log in to MetaMask and refresh.",
  "Alert Had Ticket": "This wallet address is already registered. Please show your email to the staff in the event.",
  "Alert No Refund": "There is no deposit from this wallet address recorded. Please make sure you have not yet refunded and you use the same wallet address as the one in registration.",
  "Alert No Attend": "You can only be able to refund after the event with attendance. Please wait until the event has finished and our organiser will update the smart contract to enable refund.",
  "Alert Invalid Network": "Please connect to the {networkName} on Metamask.",
  "Alert Transaction Sent": "Your transaction has been sent. Please check the transaction status on {link}. Notice: you get ticket only when transaction is successful, if your transaction is failed please check the reason on Etherscan and register it again.",
  "Alert Refund Transaction Sent": "Your transaction has been sent. Please check the transaction status on {link}",
  "Alert Without MetaMask": "You have not yet installed MetaMask. Please go to install {link} and have more than {fee} ETH for the deposit and transaction fee.",
  "Contact Us": "Contract Us",
  "Registration Amount": "Registration Amount",
  "Registration End": "Registration Ended",
  "Registration Fee": "Registration Fee",
  "feeDescription": "You can pay more registration fee to support us!"
}
